## YOLOv5-Lite-RF 配置文件
## 专为射频信号检测优化
#loss: RFLoss
## -------------------- 基础参数 ---------------------
#nc: 10                # 类别数 (10种信号类型)
#depth_multiple: 0.33  # 深度缩放因子
#width_multiple: 0.25  # 宽度缩放因子
## anchors: []           # 禁用锚点（直接回归坐标）
#anchors:                  # 锚点配置（与YOLO-LITE一致）
#  - [1.08,1.19]
#  - [3.42,4.41]
#  - [6.63,11.38]
#  - [9.42,5.11]
#  - [16.62,10.52]
#
## -------------------- Backbone ---------------------
#backbone:
#  - [-1, 1, ConvLite, [16, 3, 1, 1, 1, 'leaky']]   # C1 (256x256)
#  - [-1, 1, MP, [2, 2, 0]]                   # P1/2 (128x128)
#  - [-1, 1, ConvLite, [32, 3, 1, 1, 1, 'leaky']]   # C2
#  - [-1, 1, MP, [2, 2, 0]]                   # P2/4 (64x64)
#  - [-1, 1, ConvLite, [64, 3, 1, 1, 1, 'leaky']]   # C3
#  - [-1, 1, MP, [2, 2, 0]]                   # P3/8 (32x32)
#  - [-1, 1, ConvLite, [128, 3, 1, 1, 1, 'leaky']]  # C4
#  - [-1, 1, MP, [2, 2, 0]]                   # P4/16 (16x16)
#  - [-1, 1, ConvLite, [256, 3, 1, 1, 1, 'leaky']]  # C5
#  - [-1, 1, MP, [2, 2, 0]]                   # P5/32 (8x8)
#  - [-1, 1, ConvLite, [512, 3, 1, 1, 1, 'leaky']]  # C6 (8x8)
#
## -------------------- Head ------------------------
#head:
#  - [-1, 1, ConvLite, [256, 3, 1, 1, 1, 'leaky']]  # C7
#  - [-1, 1, Flatten, []]                         # 展平特征图
#  - [-1, 1, nn.Linear, [16*16*20, nc]]          # 全连接层 (输出维度匹配)
#  - [-1, 1, nn.Sigmoid, []]                      # Sigmoid激活


# ------------------- 基础参数 -------------------
nc: 10                    # 类别数（与YOLO-LITE对齐）
depth_multiple: 1.0  # 保持原始深度
width_multiple: 1.0  # 保持原始宽度
#depth_multiple: 0.33      # 深度缩放因子（保持轻量）
#width_multiple: 0.25      # 宽度缩放因子
anchors:                  # 锚点配置（与YOLO-LITE一致）
# yolo优化后：
  - [6,41]
  - [22,22]
  - [14,41]
  - [26,41]
  - [52,22]
# 初始：
#  - [1.08,1.19]
#  - [3.42,4.41]
#  - [6.63,11.38]
#  - [9.42,5.11]
#  - [16.62,10.52]

# ------------------- Backbone -------------------
backbone:
  # 第1阶段
  [[-1, 1, ConvLite, [32, 3, 1, None, 1, 'leaky']],  # 对应第一个convolutional层
   [-1, 1, MaxPool, [2, 2, 0]],  # maxpool层

  # 第2阶段
  [-1, 1, ConvLite, [64, 3, 1, None, 1, 'leaky']],
   [-1, 1, MaxPool, [2, 2, 0]],

  # 第3阶段
  [-1, 1, ConvLite, [128, 3, 1, None, 1, 'leaky']],
   [-1, 1, MaxPool, [2, 2, 0]],

  # 第4阶段
  [-1, 1, ConvLite, [256, 3, 1, None, 1, 'leaky']],
   [-1, 1, MaxPool, [2, 2, 0]],

  # 第5阶段
  [-1, 1, ConvLite, [512, 3, 1, None, 1, 'leaky']],
#   [-1, 1, MaxPool, [2, 2, 0]] # 注释掉则特征图大小改变：8*8 -> 16*16
  ]



# ------------------- Head -------------------
head:
  # 检测头（对应最后两个convolutional层）
  [[-1, 1, ConvLite, [512, 3, 1, None, 1, 'leaky']],  # 倒数第二层
   [-1, 1, ConvLite, [(nc+5)*len(anchors), 1, 1, None, 1, 'linear']],  # 输出层
   [[-1], 1, RegionLite, [nc, anchors, [(nc+5)*len(anchors)]]]  # 自定义Region层
  ]
#  - [[10], 1, RegionLite, [nc, anchors, [125]]]  # 显式传递参数 <-- 关键修改

